In [2]:
%load_ext autoreload
%autoreload 2

In [1]:
from src.data_loader import DataLoader
from src.preprocess import cambio_escala

In [7]:
data = DataLoader().load_datos_personales()
data.head()

  user         name age sex occupation children y_c_age o_c_age
0  123  Usuario_123  37   F          3        1       3       8
1  124  Usuario_124  42   F          8        1       3       8
2  125  Usuario_125  35   F         10        0       0       0
3  126  Usuario_126  50   F          4        0       0       0
4  127  Usuario_127  66   F         11        1      35      44

In [2]:
data = DataLoader().load_puntuaciones()
data = cambio_escala(data)
data.head()

  user  place  score
0  123  17376   8.33
1  123  17377   8.33
2  123  17380   8.33
3  123  17392   3.33
4  123  17395   5.00

In [3]:
data = DataLoader().load_puntuaciones_test()
data = cambio_escala(data)
data.head()

  user  place  score
0  123  17365   8.33
1  123  17366   3.33
2  123  17367   3.33
3  123  17369   8.33
4  123  17371   8.33

In [11]:
data = DataLoader().load_clasificacion_items()
data.head()

    item preference score
0  17365         65    61
1  17365         68    67
2  17366         62    78
3  17366         68    75
4  17367         26    20

In [29]:
data = DataLoader().load_items()
data.head()

    item                                name views
0  17365  Casa de las Rocas-Museo del Corpus    11
1  17366                Casa-Museo Benlliure    11
2  17367            Casa-Museo Blasco Ibañez    11
3  17369   Centro cultural Fundación Bancaja    30
4  17371              Centro del Carmen-IVAM    26

In [31]:
data = DataLoader().load_preferencias()
data.head()

  preference                    name father
0          1      Estilos y periodos      0
1          2                 Compras      0
2          3                  Museos      0
3          4       Espacios Abiertos      0
4          5  Arquitectura religiosa      0

In [33]:
data = DataLoader().load_usuarios_preferencias()
data.head()

  user preference score
0  123         16     8
1  123         17     9
2  123         18     9
3  123         19     8
4  123         20    10

In [38]:
data = DataLoader().load_ocupaciones()
data.head()

  occupation                                               name
0          1                                    Fuerzas armadas
1          2  Dirección de las empresas y de las administrac...
2          3  Técnicos y profesionales científicos e intelec...
3          4                  Técnicos y profesionales de apoyo
4          5                   Empleados de tipo administrativo